//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c)  1999 - 2015 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// 
// 
// Module Name:
//
//   SetupStrings.vfr
// 
// Abstract:
// 
//   String definitions for Setup formsets.
// 
// Revision History:
// 
// --*/

/=#

#langdef   en-US "English"
#langdef   fr-FR "Français"
#langdef   es-ES "Español"
#langdef uqi "UQI"

//
// Main 
//
#string STR_MAIN_TITLE                  #language en-US "Main"
#string STR_MAIN_HELP                   #language en-US "Press <Enter> to select the Main System Setup options."

#string STR_BIOS_REVISION_PROMPT        #language en-US "BIOS Revision"
#string STR_BIOS_REVISION_VALUE         #language en-US ""

#string STR_RC_REVISION_PROMPT         #language en-US "RC Revision"
#string STR_RC_REVISION_VALUE          #language en-US ""

#string STR_CSM_REVISION_PROMPT         #language en-US "CSM Revision"
#string STR_CSM_REVISION_VALUE          #language en-US ""

#string STR_CPU_BSP_REVISION_PROMPT      #language en-US "Processor BSP Revision"
#string STR_CPU_BSP_REVISION_VALUE       #language en-US ""

#string STR_PCH_REVISION_PROMPT         #language en-US "PCH Revision"
#string STR_PCH_REVISION_VALUE          #language en-US ""

#string STR_PLATFORM_REVISION_PROMPT    #language en-US "Platform"
#string STR_PLATFORM_REVISION_VALUE     #language en-US ""

#string STR_TOTAL_MEMORY_SIZE_PROMPT    #language en-US "Total Memory"
#string STR_TOTAL_MEMORY_SIZE_VALUE     #language en-US "???"

#string STR_MEMORY_MODE_PROMPT          #language en-US "Memory Mode"
#string STR_MEMORY_MODE_VALUE           #language en-US "???"
#string STR_MEMORY_MODE_SINGLE          #language en-US "Single"
#string STR_MEMORY_MODE_DUAL            #language en-US "Dual"

#string STR_TIME_PROMPT                 #language en-US "System Time"
#string STR_TIME_HOUR_HELP              #language en-US "Use 24 hour format for entering hours: 15:00 for 3pm"
#string STR_TIME_MINUTE_HELP            #language en-US "0 - 59"
#string STR_TIME_SECOND_HELP            #language en-US "0 - 59"

#string STR_DATE_PROMPT                 #language en-US "System Date"
#string STR_DATE_MONTH_HELP             #language en-US "Use Month / Day / Year format"
#string STR_DATE_DAY_HELP               #language en-US "1 - 31"
#string STR_DATE_YEAR_HELP              #language en-US "2003 - 2100"

#string STR_ME_REVISION_PROMPT                  #language en-US "ME version"
#string STR_ME_REVISION_VALUE                   #language en-US "N/A"
// Denverton Aptiov override Start - EIP#217439
//
// Intel RC Setup
//
#string STR_INTELRCSETUP_TITLE              #language en-US "IntelRCSetup"
#string STR_INTELRCSETUP_TITLE_LINK         #language en-US "Return to IntelRCSetup Options"
#string STR_INTELRCSETUP_HELP               #language en-US "Press <Enter> to select the IntelRCSetup options."
// Denverton Aptiov override End - EIP#217439

#string STR_WARNING_MESSAGE1            #language en-US "Setup Warning:"
#string STR_WARNING_MESSAGE2            #language en-US "Setting items on this Screen to incorrect values"
#string STR_WARNING_MESSAGE3            #language en-US "may cause system to malfunction!"

// Denverton AptioV Override Start - EIP#291342
#string STR_SATA_DEVICE_INFO            #language en-US "Device Information:"
#string STR_SATA_DEVICE_SIZE            #language en-US "Device Size:"

#string STR_SATA0_PORT0_STRING            #language en-US "SATA 0 Port 0"
#string STR_SATA0_PORT0_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT0_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT1_STRING          #language en-US "SATA 0 Port 1"
#string STR_SATA0_PORT1_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT1_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT2_STRING          #language en-US "SATA 0 Port 2"
#string STR_SATA0_PORT2_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT2_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT3_STRING          #language en-US "SATA 0 Port 3"
#string STR_SATA0_PORT3_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT3_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT4_STRING          #language en-US "SATA 0 Port 4"
#string STR_SATA0_PORT4_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT4_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT5_STRING          #language en-US "SATA 0 Port 5"
#string STR_SATA0_PORT5_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT5_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT6_STRING          #language en-US "SATA 0 Port 6"
#string STR_SATA0_PORT6_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT6_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT7_STRING          #language en-US "SATA 0 Port 7"
#string STR_SATA0_PORT7_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT7_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT0_STRING          #language en-US "SATA 1 Port 0"
#string STR_SATA1_PORT0_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT0_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT1_STRING          #language en-US "SATA 1 Port 1"
#string STR_SATA1_PORT1_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT1_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT2_STRING          #language en-US "SATA 1 Port 2"
#string STR_SATA1_PORT2_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT2_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT3_STRING          #language en-US "SATA 1 Port 3"
#string STR_SATA1_PORT3_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT3_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT4_STRING          #language en-US "SATA 1 Port 4"
#string STR_SATA1_PORT4_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT4_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT5_STRING          #language en-US "SATA 1 Port 5"
#string STR_SATA1_PORT5_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT5_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT6_STRING          #language en-US "SATA 1 Port 6"
#string STR_SATA1_PORT6_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT6_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT7_STRING          #language en-US "SATA 1 Port 7"
#string STR_SATA1_PORT7_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT7_SIZE            #language en-US "[Unknown]"
// Denverton AptioV Override End - EIP#291342

// Denverton AptioV Override Start - EIP#235760
/*
#string STR_NETWORK_CONFIGURATION       #language en-US "Network Configuration"
#string STR_NETWORK_CONFIGURATION_HELP  #language en-US "Network Configuration"

#string STR_PCH_PXEROM_CONTROL          #language en-US "Legacy PXE ROM"
#string STR_PCH_PXEROM_CONTROL_HELP     #language en-US "Enable/Disable Legacy PXE Option ROM execution for LANs."

#string STR_EFI_NETWORK_CONTROL         #language en-US "EFI Network"
#string STR_EFI_NETWORK_CONTROL_HELP    #language en-US "Enable/Disable EFI Network support for LANs."

#string STR_EFI_NETWORK_CONTROLER_0       #language en-US "GBE controller 0"
#string STR_EFI_NETWORK_CONTROLER_1       #language en-US "GBE controller 1"
#string STR_EFI_NETWORK_CONTROLER_2       #language en-US "GBE controller 2"
#string STR_EFI_NETWORK_CONTROLER_3       #language en-US "GBE controller 3"
#string STR_EFI_NETWORK_CONTROLER_HELP  #language en-US "Enable/Disable the GBE hardware controller if supported by SKU"
*/
// Denverton AptioV Override End - EIP#235760

//
// Advanced - Miscelleneous Configuration
//
#string STR_MISC_FORM_TITLE             #language en-US "Miscellaneous Configuration"
#string STR_MISC_FORM_HELP              #language en-US ""
//  Denverton Aptiov override start - EIP#217439
// WOL

#string STR_WOL_CONFIGURATION           #language en-US "Wake On Lan Configuration"
#string STR_WOL_CONFIGURATION_HELP      #language en-US "Wake On Lan Configuration settings"
//  Denverton Aptiov override end - EIP#217439
// Denverton AptioV Override Start - EIP#235760
/*
#string STR_DEBUGLEVEL_PROMPT           #language en-US "Debug print error level"
#string STR_DEBUGLEVEL_HELP             #language en-US "Select debug error level output to COM port"
#string STR_DEBUGLEVEL_ERRORS           #language en-US "Errors"
#string STR_DEBUGLEVEL_WARNINGS         #language en-US "Warnings"
#string STR_DEBUGLEVEL_INFORMATIONAL    #language en-US "Informational"
#string STR_DEBUGLEVEL_VERBOSE          #language en-US "Verbose"
#string STR_MRC_DBG_MSG_AUTO            #language en-US "General options"
#string STR_DFX_DBGMSG_TITLE            #language en-US "Additional debug messages"
#string STR_DFX_DBGMSG_HELP             #language en-US "Select additional debug messages from list"
#string STR_DFX_DBGMSG_SUBTITLE         #language en-US "Select additional debug messages for output from the list below"
#string STR_DBGMSG_INIT                 #language en-US "Initialization"
#string STR_DBGMSG_WARN                 #language en-US "Warnings"
#string STR_DBGMSG_LOAD                 #language en-US "Load events"
#string STR_DBGMSG_FS                   #language en-US "EFI File System"
#string STR_DBGMSG_POOL                 #language en-US "Pool Alloc and Free"
#string STR_DBGMSG_PAGE                 #language en-US "Page Alloc and Free"
#string STR_DBGMSG_INFO                 #language en-US "Informational debug messages"
#string STR_DBGMSG_DISPATCH             #language en-US "PEI/DXE/SMM Dispatchers"
#string STR_DBGMSG_VARIABLE             #language en-US "Variable"
#string STR_DBGMSG_BM                   #language en-US "Boot Manager"
#string STR_DBGMSG_BLKIO                #language en-US "BlkIo Driver"
#string STR_DBGMSG_NET                  #language en-US "SNI Driver"
#string STR_DBGMSG_UNDI                 #language en-US "UNDI Driver"
#string STR_DBGMSG_LOADFILE             #language en-US "Load File"
#string STR_DBGMSG_EVENT                #language en-US "Event messages"
#string STR_DEBUG_GCD                   #language en-US "Global Coherency Database changes"
#string STR_DEBUG_CACHE	                #language en-US "Memory range cachability changes"
#string STR_DBGMSG_VERBOSE              #language en-US "Verbose - Detailed messages that may significantly impact boot performance"
#string STR_DBGMSG_ERROR                #language en-US "Errors"
*/
// Denverton AptioV Override End - EIP#235760
//
// Mailbox
//
#string STR_MAILBOX_CORE_PUNIT_BGF_PROMPT      #language en-US "Core-Uncore BGF pointer separation"
#string STR_MAILBOX_CORE_PUNIT_BGF_HELP        #language en-US "Select BGF pointer separation"

//
// Video Configuration
//
#string STR_VIDEO_FORM_TITLE            #language en-US "Video Configuration"
#string STR_VIDEO_FORM_HELP             #language en-US ""

#string STR_VIDEO_SELECT_PROMPT         #language en-US "Active Video"
#string STR_VIDEO_SELECT_HELP           #language en-US "Select active Video type"
#string STR_VIDEO_SELECT_ONBOARD        #language en-US "Onboard Device"
#string STR_VIDEO_SELECT_PCIE           #language en-US "PCIE Device"

#string STR_SATA_SELECT_PROMPT         #language en-US "Active SATA Boot Device"
#string STR_SATA_SELECT_HELP           #language en-US "Select the active SATA boot device"
#string STR_SATA_SELECT_ONBOARD        #language en-US "Onboard Device"
#string STR_SATA_SELECT_PCIE           #language en-US "PCIE Device"

#string STR_INSPECCMMCLB_OPTION_PROMPT        #language en-US "Inspeccmm"
#string STR_INSPECCMMCLB_OPTION_HELP          #language en-US "Required to test PCIe CLB"

#string STR_EFI_INT10_PROMPT            #language en-US "EFI INT10 workaround"
#string STR_EFI_INT10_HELP              #language en-US "Select to enable INT10 video with EFI Optimized boot"

//
// Boot Options Screen
//
#string STR_BOOT_OPTIONS                #language en-US "Boot Device Priority"

#string STR_HORIZONTAL_LINE             #language en-US "──────────────────────────────────────────────────"
#string STR_DOUBLE_LINE                 #language en-US "========================================"
#string STR_BOOT_MANAGER_TITLE          #language en-US "Boot Manager"
#string STR_BOOT_MANAGER_HELP           #language en-US "Boot Manager"
#string STR_EFI_SHELL                   #language en-US "Launch EFI Shell"
#string STR_BOOT_OPTION_0               #language en-US "Boot Option 0"
#string STR_BOOT_OPTION_1               #language en-US "Boot Option 1"
#string STR_BOOT_OPTION_2               #language en-US "Boot Option 2"
#string STR_BOOT_OPTION_3               #language en-US "Boot Option 3"
#string STR_BOOT_OPTION_4               #language en-US "Boot Option 4"
#string STR_BOOT_OPTION_5               #language en-US "Boot Option 5"
#string STR_BOOT_OPTION_6               #language en-US "Boot Option 6"
#string STR_BOOT_OPTIONS_TITLE          #language en-US "Boot Options"
#string STR_BOOT_OPTIONS_HELP           #language en-US "Boot Options"
#string STR_BOOT_TIMEOUT_PROMPT         #language en-US "System Boot Timeout"
#string STR_BOOT_TIMEOUT_HELP           #language en-US "Set the default timeout before system boot.  A value of 65535 will disable the timeout completely."
#string STR_BOOT_ORDER_HELP             #language en-US "Sets the system boot order"
#string STR_BOOT_ORDER_1                #language en-US "Boot Option #1"
#string STR_BOOT_ORDER_2                #language en-US "Boot Option #2"
#string STR_BOOT_ORDER_3                #language en-US "Boot Option #3"
#string STR_BOOT_ORDER_4                #language en-US "Boot Option #4"
#string STR_HARD_DISK_ORDER             #language en-US "Hard Disk Order"
#string STR_HARD_DISK_ORDER_HELP        #language en-US "Set the order of the hard disks"
#string STR_CDROM_ORDER                 #language en-US "CDROM Order"
#string STR_CDROM_ORDER_HELP            #language en-US "Set the order of the CDROM drives"
#string STR_FLOPPY_DISK_ORDER           #language en-US "Floppy Order"
#string STR_FLOPPY_DISK_ORDER_HELP      #language en-US "Set the order of the floppy disks"
#string STR_NETWORK_ORDER               #language en-US "Network Device Order"
#string STR_NETWORK_ORDER_HELP          #language en-US "Set the order of the network boot devices"
#string STR_EXIT_TITLE                  #language en-US "Exit"
#string STR_SAVE_EXIT                   #language en-US "Save & Exit"
#string STR_DISCARD_EXIT                #language en-US "Discard changes & exit"
#string STR_SAVE                        #language en-US "Save Changes"
#string STR_DISCARD                     #language en-US "Discard Changes"
#string STR_RESTORE_DEFAULTS            #language en-US "Restore Default Values"
#string STR_SAVE_USER_DEFAULTS          #language en-US "Save the User Default Values"
#string STR_RESTORE_USER_DEFAULTS       #language en-US "Restore the User Default Values"
#string STR_BOOT_ORDER_X                #language en-US "Boot Option #%d"
#string STR_BOOT_ORDER_HELP             #language en-US "Sets the system boot order"

#string STR_HARD_DISK_ORDER_X           #language en-US "Hard Disk #%d"
#string STR_HARD_DISK_ORDER             #language en-US "Hard Disk Order"
#string STR_HARD_DISK_ORDER_HELP        #language en-US "Set the order of the hard disks"
#string STR_CDROM_ORDER_X               #language en-US "CDROM #%d"
#string STR_CDROM_ORDER                 #language en-US "CDROM Order"
#string STR_CDROM_ORDER_HELP            #language en-US "Set the order of the CDROM drives"
#string STR_FLOPPY_DISK_ORDER_X         #language en-US "Floppy Disk #%d"
#string STR_FLOPPY_DISK_ORDER           #language en-US "Floppy Order"
#string STR_FLOPPY_DISK_ORDER_HELP      #language en-US "Set the order of the floppy disks"
#string STR_NETWORK_ORDER_X             #language en-US "Network Device #%d"
#string STR_NETWORK_ORDER               #language en-US "Network Device Order"
#string STR_NETWORK_ORDER_HELP          #language en-US "Set the order of the network boot devices"
#string STR_BEV_ORDER_X                 #language en-US "BEV Device #%d"
#string STR_BEV_ORDER                   #language en-US "BEV Device Order"
#string STR_BEV_ORDER_HELP              #language en-US "Sets the boot order of Bootstrap Entry Vector Devices. BEV devices are devices which have a bootable Option ROM such as add-in or onboard NICs."

#string STR_ADD_BOOT_OPTION             #language en-US "Add New Boot Option"
#string STR_ADD_BOOT_OPTION_HELP        #language en-US "Add a new EFI boot option to the boot order"
#string STR_DEL_BOOT_OPTION             #language en-US "Delete Boot Option"
#string STR_DEL_BOOT_OPTION_HELP        #language en-US "Remove an EFI boot option from the boot order"
#string STR_ADD_BOOT_LABEL              #language en-US "Add boot option label"
#string STR_BOOT_LABEL_HELP             #language en-US "Create the label for the new boot option"
#string STR_ADD_BOOT_PATH               #language en-US "Path for boot option"
#string STR_BOOT_PATH_HELP              #language en-US "Enter the path to the boot option in the format fs0:\\path\\filename.efi"
#string STR_SAVE_BOOT_OPTION            #language en-US "Save"

//
// TPM Strings
//
#string STR_TPM_SUPPORT_PROMPT          #language en-US "TPM v1.2 Support"
#string STR_TPM_SUPPORT_HELP            #language en-US "Enable or disable the TPM support"

//
// TPM Command
//
#string STR_TPM_COMMAND_PROMPT          #language en-US  "Pending TPM Command"
#string STR_TPM_COMMAND_HELP            #language en-US  "Pending TPM Physical Presence command"

#string STR_ONE_OF_TPM0                 #language en-US  "#0 = No pending command"
#string STR_ONE_OF_TPM1                 #language en-US  "#1 = TPM_PhysicalEnable"
#string STR_ONE_OF_TPM2                 #language en-US  "#2 = TPM_PhysicalDisable"
#string STR_ONE_OF_TPM3                 #language en-US  "#3 = TPM_PhysicalSetDeactivated (FALSE)"
#string STR_ONE_OF_TPM4                 #language en-US  "#4 = TPM_PhysicalSetDeactivated (TRUE)"
#string STR_ONE_OF_TPM5                 #language en-US  "#5 = TPM_ForceClear"
#string STR_ONE_OF_TPM6                 #language en-US  "#6 = #1 + #3"
#string STR_ONE_OF_TPM7                 #language en-US  "#7 = #4 + #2"
#string STR_ONE_OF_TPM8                 #language en-US  "#8 = TPM_SetOwnerInstall (TRUE)"
#string STR_ONE_OF_TPM9                 #language en-US  "#9 = TPM_SetOwnerInstall (FALSE)"
#string STR_ONE_OF_TPM10                #language en-US  "#10 = #6 + #8"
#string STR_ONE_OF_TPM11                #language en-US  "#11 = #7 + #9"
#string STR_ONE_OF_TPM12                #language en-US  "#12 = TPM_SetTempDeactivated"
#string STR_ONE_OF_TPM13                #language en-US  "#13 = TPM_SetOperatorAuth"
#string STR_ONE_OF_TPM14                #language en-US  "#14 = #5 + #6"

#string STR_MOR_PROMPT                     #language en-US "MOR State"
#string STR_MOR_HELP                       #language en-US "Enable/Disable the MOR (Memory Overwrite Request) feature"
//
// Debug Messages
//
#string STR_DEBUG_MSG_PROMPT            #language en-US "Debug Messages"
#string STR_DEBUG_MSG_HELP              #language en-US "Enable or Disable Serial Port Debug Messages"
#string STR_TERMINAL_PROMPT             #language en-US "Terminal"
#string STR_TERMINAL_HELP               #language en-US "Enable or Disable Terminal (Serial Port)"

//
// Common Strings
//
#string STR_NULL_STRING                 #language en-US ""
#string STR_UNKNOWN                     #language en-US "Unknown"
#string STR_INSTALLED                   #language en-US "Installed"
#string STR_NOTINSTALLED                #language en-US "Not Installed"
#string STR_NOTPRESENT                  #language en-US "Not Present"
#string STR_UNSUPPORTED                 #language en-US "Unsupported"
#string STR_ENABLE                      #language en-US "Enable"
#string STR_DISABLE                     #language en-US "Disable"
#string STR_AUTO                        #language en-US "Auto"
#string STR_ERROR_POPUP                 #language en-US "Try Again"
#string STR_ON                          #language en-US "On"
#string STR_OFF                         #language en-US "Off"
#string STR_NONE                        #language en-US "None"

//
// Manageability Engine (ME) Strings
//
#string STR_ME_SUPPORT_PROMPT           #language en-US "ME Support"
#string STR_ME_SUPPORT_HELP             #language en-US "Enable or disable the ME support"
#string STR_ME_VIA_BMC_PROMPT           #language en-US "ME via BMC"
#string STR_ME_VIA_BMC_HELP             #language en-US "Enable or disable BMC mediation in BIOS-ME communication"
#string STR_ME_END_OF_POST_PROMPT       #language en-US "ME End of Post"
#string STR_ME_END_OF_POST_HELP         #language en-US "Enable or disable sending End of Post HECI message to ME and hiding HECI devices (debug option)"
#string STR_ME_FW_STATE_PROMPT          #language en-US "ME FW State"

//
// Vt related string
//
#string STR_ARI_ENABLE_PROMPT              #language en-US "ARI Support"
#string STR_ARI_ENABLE_HELP                #language en-US "Enable or disable the ARI support"   
#string STR_ARI_FORWARD_PROMPT             #language en-US "ARI Forward"
#string STR_ARI_FORWARD_HELP               #language en-US "Enable or disable the ARI Forward"
#string STR_SR_IOV_ENABLE_PROMPT           #language en-US "SR-IOV Support"
#string STR_SR_IOV_ENABLE_HELP             #language en-US "Enable or disable the SR-IOV support"   
#string STR_MR_IOV_ENABLE_PROMPT           #language en-US "MR-IOV Support"
#string STR_MR_IOV_ENABLE_HELP             #language en-US "Enable or disable the MR-IOV support"   
#string STR_SR_IOV_SYSTEM_PAGE_SIZE_PROMPT #language en-US "SR-IOV SystemPageSize"
#string STR_SR_IOV_SYSTEM_PAGE_SIZE_HELP   #language en-US "SR-IOV SystemPageSize"
#string STR_4K                             #language en-US "4K"
#string STR_8K                             #language en-US "8K"
#string STR_64K                            #language en-US "64K"
#string STR_256K                           #language en-US "256K"
#string STR_1M                             #language en-US "1M"
#string STR_4M                             #language en-US "4M"

//
// S5 RTC Wakeup
//
#string STR_WAKE_ON_RTC_PROMPT                  #language en-US "RTC Wake system from S5"
#string STR_WAKE_ON_RTC_HELP                    #language en-US "Enable or disable System wake on alarm event. When enabled, System will wake on the day::hr::min::sec specified"
#string STR_RTC_WAKEUP_HOUR_PROMPT              #language en-US "  Wake up hour"
#string STR_RTC_HOUR_HELP                       #language en-US "select 0-23 For example enter 3 for 3am and 15 for 3pm"
#string STR_RTC_WAKEUP_MINUTE_PROMPT            #language en-US "  Wake up minute"
#string STR_RTC_WAKEUP_SECOND_PROMPT            #language en-US "  Wake up second"
#string STR_TIME_MINUTE_HELP                    #language en-US  "0 - 59"
#string STR_TIME_SECOND_HELP                    #language en-US  "0 - 59"

//
// RTC Lock
//
#string STR_PCH_RTC_LOCK_PROMPT                     #language en-US "RTC Lock"
#string STR_PCH_RTC_LOCK_HELP                       #language en-US "Enable will lock bytes 38h-3Fh in the lower/upper 128-byte bank of RTC RAM"


#string STR_SHELL_POSITION_PROMPT                   #language en-US "EFI SHELL POSITION"
#string STR_SHELL_POSITION_HELP                     #language en-US "Sets efi shell position in the Boot order (Top or Bottom)"
#string STR_TOP_STRING                              #language en-US "TOP"
#string STR_BOTTOM_STRING                           #language en-US "BOTTOM"

#string STR_DFX_ADVANCE_DEBUG_PROMPT     #language en-US "Advanced Debug Function"
#string STR_DFX_ADVANCE_DEBUG_HELP       #language en-US "Advanced Debug Function (Dfx Knob)"
#string STR_AFTERG3_EN_PROMPT                        #language en-US "AC Power restore behavior"
#string STR_AFTERG3_EN_HELP                          #language en-US "Configures the AFTERG3_EN bit on the General PM Configuration 1 register"
#string STR_AFTERG3_AUTO                             #language en-US "Determine from Pin Strap"
#string STR_AFTERG3_0                                #language en-US "Power ON"
#string STR_AFTERG3_1                                #language en-US "Stay Off"

// Denverton AptioV Override Start - EIP#235760
//#string STR_CONSOLE_REDIR_PROMPT                     #language en-US "Console Redirection"
//#string STR_CONSOLE_REDIR_HELP                       #language en-US "Enable/ Disable Console Redirection"
// Denverton AptioV Override End - EIP#235760

#string STR_FIA_CONFIG_TITLE                   #language en-US "Fia Mux Configuration"
#string STR_FIA_CONFIG_TITLE_HELP              #language en-US "Configuration of FIA Mux" 
#string STR_FIA_CONFIG_FORM                      #language en-US "Denverton FIA Mux Configuration"
#string STR_FIA_CONFIG_FORM_HELP                 #language en-US "Configure FIA Mux Parameters"
#string STR_FIA_CONFIG_FORM_TITLE                #language en-US "Denverton FIA Mux Configuration"
#string STR_FIA_CONFIG_SUBTITLE                  #language en-US "FIA Mux Configuration"
#string STR_FIA_CONFIG_OVERRIDE                  #language en-US "FIA Mux Configuration Override"
#string STR_FIA_CONFIG_OVERRIDE_HELP             #language en-US "By Enabling this you override the platform configuration on FIA/WM"

// Denverton AptioV override start - EIP#332934
#string STR_FIA_BIF_CLUSTER_0_PROMPT             #language en-US "Bifurcation Control 0"
#string STR_FIA_BIF_CLUSTER_1_PROMPT             #language en-US "Bifurcation Control 1"

#string STR_FIA_BIF_CLUSTER_0_HELP               #language en-US "Bifurcation control for PCIE RootPort Cluster 0"
#string STR_FIA_BIF_CLUSTER_1_HELP               #language en-US "Bifurcation control for PCIE RootPort Cluster 1"

#string STR_FIA_BIF_X2X2X2X2                     #language en-US "x2x2x2x2"
#string STR_FIA_BIF_X2X2X4                       #language en-US "x2x2x4"
#string STR_FIA_BIF_X4X2X2                       #language en-US "x4x2x2"
#string STR_FIA_BIF_X4X4                         #language en-US "x4x4"
#string STR_FIA_BIF_X8                           #language en-US "x8"
// Denverton AptioV override end - EIP#332934

#string STR_FIA_CONFIG_LANE0_PROMPT                  #language en-US "Lane 0"
#string STR_FIA_CONFIG_LANE1_PROMPT                  #language en-US "Lane 1"
#string STR_FIA_CONFIG_LANE2_PROMPT                  #language en-US "Lane 2"
#string STR_FIA_CONFIG_LANE3_PROMPT                  #language en-US "Lane 3"
#string STR_FIA_CONFIG_LANE4_PROMPT                  #language en-US "Lane 4"
#string STR_FIA_CONFIG_LANE5_PROMPT                  #language en-US "Lane 5"
#string STR_FIA_CONFIG_LANE6_PROMPT                  #language en-US "Lane 6"
#string STR_FIA_CONFIG_LANE7_PROMPT                  #language en-US "Lane 7"
#string STR_FIA_CONFIG_LANE8_PROMPT                  #language en-US "Lane 8"
#string STR_FIA_CONFIG_LANE9_PROMPT                  #language en-US "Lane 9"
#string STR_FIA_CONFIG_LANE10_PROMPT                  #language en-US "Lane 10"
#string STR_FIA_CONFIG_LANE11_PROMPT                  #language en-US "Lane 11"
#string STR_FIA_CONFIG_LANE12_PROMPT                  #language en-US "Lane 12"
#string STR_FIA_CONFIG_LANE13_PROMPT                  #language en-US "Lane 13"
#string STR_FIA_CONFIG_LANE14_PROMPT                  #language en-US "Lane 14"
#string STR_FIA_CONFIG_LANE15_PROMPT                  #language en-US "Lane 15"
#string STR_FIA_CONFIG_LANE16_PROMPT                  #language en-US "Lane 16"
#string STR_FIA_CONFIG_LANE17_PROMPT                  #language en-US "Lane 17"
#string STR_FIA_CONFIG_LANE18_PROMPT                  #language en-US "Lane 18"
#string STR_FIA_CONFIG_LANE19_PROMPT                  #language en-US "Lane 19"

// Denverton AptioV override start - EIP#332934
#string STR_FIA_PCIE_RP0_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 0 Link Width "
#string STR_FIA_PCIE_RP1_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 1 Link Width"
#string STR_FIA_PCIE_RP2_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 2 Link Width"
#string STR_FIA_PCIE_RP3_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 3 Link Width"
#string STR_FIA_PCIE_RP4_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 4 Link Width"
#string STR_FIA_PCIE_RP5_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 5 Link Width"
#string STR_FIA_PCIE_RP6_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 6 Link Width"
#string STR_FIA_PCIE_RP7_LINK_WIDTH_CONFIG_PROMPT    #language en-US "RootPort 7 Link Width"

#string STR_FIA_PCIE_RP_LINK_WIDTH_CONFIG            #language en-US "[If BICTRL=>: Disable the RP if ANY of the LANE below it is NOT PCIE] [If X1 => Do not disable RP if the LANE[0] below it is assigned as PCIE "

#string STR_FIA_RP_LINKWIDTH_BICTRL                   #language en-US "BICTRL"
#string STR_FIA_RP_LINKWIDTH_X1                       #language en-US "X1"
#string STR_FIA_PCIE_RP_LINK_WIDTH_CONFIG_SUBTITLE    #language en-US "PCIE RootPort Link Width Control" 
// Denverton AptioV override end - EIP#332934

#string STR_FIA_LANE_DISABLED                         #language en-US "Lane Disabled"
#string STR_FIA_LANE_PCIE                             #language en-US "PCIE Function"
#string STR_FIA_LANE_SATA                             #language en-US "SATA Function"
#string STR_FIA_LANE_XHCI                             #language en-US "XHCI Function"

#string STR_FIA_CONFIG_PCIE                  #language en-US "Select Lane to work as Disabled / Pcie"
#string STR_FIA_CONFIG_PCIE_SATA             #language en-US "Select Lane to work as Disabled / Pcie / Sata"
#string STR_FIA_CONFIG_SATA_XHCI             #language en-US "Select Lane to work as Disabled / Sata / Xhci"





// End of file
//
